arch/regression_results/AC20-FZK-Haus/OpenFOAM/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		radiationProperties;
}

constantAbsorptionEmissionCoeffs
{

    absorptivity		absorptivity [m^-1] 0.001;

    emissivity		emissivity [m^-1] 0.001;

    E		E [kg m^-1 s^-3] 0;

}

radiation		on;

radiationModel		P1;

solverFreq		1;

absorptionEmissionModel		constantAbsorptionEmission;

sootModel		none;

scatterModel		none;

transmissivityModel		none;