arch/regression_results/AC20-FZK-Haus/OpenFOAM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		T;
}

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 293.15;

boundaryField
{

    InnerWall_3S62uZocO66ngdmMaRS2M9
    {

        type		fixedValue;

        value		uniform 293.0585347428028;

    }

    Ceiling_14TeGe_aGDXLMTt8fX0vQP
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		uniform -51.84420429210972;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 292.5756442184813;

    }

    InnerWall_1zvtHpRHFWSVHgO9MXUL0M
    {

        type		fixedValue;

        value		uniform 292.7535680086111;

    }

    InnerDoor_1aGihCk9trZ___gjiWxX___Jdv
    {

        type		fixedValue;

        value		uniform 292.8899140573907;

    }

    GroundFloor_2Sn7uAlFxA___POrax5b6wqo
    {

        type		fixedValue;

        value		uniform 291.9938640841192;

    }

    OuterWall_3XYW9SWB7YBTXnJuv3X___K5
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		uniform -78.47656724801465;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 291.2415220038557;

    }

    OuterWall_3XTF9VnRG___5_FyP6rRZVuw
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		uniform -80.54845294650337;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 291.3313470466551;

    }

    Window_2CVWUzpEdesdJARzpmJYC8
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		uniform 102.96846321595073;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 290.6755261062978;

    }

    Window_2NviMh_1vArANYae7v_22c
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		uniform 102.93346964972234;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 290.67313778390246;

    }

    heater0_surface
    {

        type		externalWallHeatFluxTemperature;

        mode		power;

        qr		qr;

        Q		76.61082309439237;

        qrRelaxation		0.003;

        relaxation		1.0;

        kappaMethod		fluidThermo;

        kappa		fluidThermo;

        value		uniform 313.15;

    }

    inlet_diffuser
    {

        type		zeroGradient;

    }

    inlet_source_sink
    {

        type		fixedValue;

        value		uniform 293.15;

    }

    outlet_diffuser
    {

        type		zeroGradient;

    }

    outlet_source_sink
    {

        type		inletOutlet;

        inletValue		$internalField;

        value		$internalField;

    }

    boundingbox
    {

        type		zeroGradient;

    }

}