arch/regression_results/AC20-FZK-Haus/OpenFOAM/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.5                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		topoSetDict;
}

actions (		//;

//heater0
{

    name		heater0_porous_media;

    action		new;

    type		cellSet;

    source		surfaceToCell;

    sourceInfo
    {

        file		"constant/triSurface/heater0_porous_media.stl";

        useSurfaceOrientation		true;

        outsidePoints		((0 0 0));

        includeCut		false;

        includeInside		true;

        includeOutside		false;

        nearDistance		-1;

        curvature		0;

    }

}

);		//;